airfoil-pitching-morphing/fluid-openfoam/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	12	0	)	//	2									
	(	-11	0	0	)	//	3									
	(	0	0	0.3	)	//	4									
	(	1	0	0.3	)	//	5									
	(	1	12	0.3	)	//	6									
	(	-11	0	0.3	)	//	7									
	(	21	1.83027059770082	0	)	//	8									
	(	21	12	0	)	//	9									
	(	21	1.83027059770082	0.3	)	//	10									
	(	21	12	0.3	)	//	11									
	(	1	-12	0	)	//	12									
	(	1	-12	0.3	)	//	13									
	(	21	-12	0	)	//	14									
	(	21	-12	0.3	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	0.3	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03	0.03														
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	13.9581659180375	13.9581659180375														
	(															
(	0.0416666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.03															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03															
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
	0.0716426503218266	0.0716426503218266														
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.0416666666666667	0.354166666666667	0.0450732441103295	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-7.48528137423857	8.48528137423857	0	)									
	arc	7 6 	(	-7.48528137423857	8.48528137423857	0.3	)									
																
	spline	1	0													
	(															
	(	0.999035	0.000297	0	)											
	(	0.996145	0.001185	0	)											
	(	0.991338	0.002653	0	)											
	(	0.984631	0.004682	0	)											
	(	0.976046	0.007248	0	)											
	(	0.965613	0.010321	0	)											
	(	0.953367	0.013863	0	)											
	(	0.939351	0.017833	0	)											
	(	0.923612	0.022187	0	)											
	(	0.906208	0.026874	0	)											
	(	0.887198	0.031843	0	)											
	(	0.866653	0.03704	0	)											
	(	0.844647	0.042411	0	)											
	(	0.82126	0.047899	0	)											
	(	0.796579	0.053449	0	)											
	(	0.770697	0.059005	0	)											
	(	0.743712	0.064511	0	)											
	(	0.715726	0.069913	0	)											
	(	0.686848	0.075158	0	)											
	(	0.657189	0.080194	0	)											
	(	0.626866	0.084971	0	)											
	(	0.595998	0.089439	0	)											
	(	0.564709	0.093554	0	)											
	(	0.533123	0.097269	0	)											
	(	0.50137	0.100545	0	)											
	(	0.469578	0.103344	0	)											
	(	0.437879	0.105631	0	)											
	(	0.406404	0.107376	0	)											
	(	0.37482	0.108468	0	)											
	(	0.343599	0.108714	0	)											
	(	0.313001	0.10811	0	)											
	(	0.283167	0.10667	0	)											
	(	0.254236	0.104416	0	)											
	(	0.226341	0.101384	0	)											
	(	0.19961	0.097618	0	)											
	(	0.174166	0.093172	0	)											
	(	0.150121	0.088108	0	)											
	(	0.127583	0.082496	0	)											
	(	0.106649	0.07641	0	)											
	(	0.087405	0.06993	0	)											
	(	0.069929	0.063138	0	)											
	(	0.054289	0.056114	0	)											
	(	0.04054	0.048938	0	)											
	(	0.028731	0.041689	0	)											
	(	0.018897	0.034435	0	)											
	(	0.011066	0.027241	0	)											
	(	0.005256	0.020161	0	)											
	(	0.001476	0.013241	0	)											
	(	-0.000274	0.006513	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.999035	0.000297	0.3	)											
	(	0.996145	0.001185	0.3	)											
	(	0.991338	0.002653	0.3	)											
	(	0.984631	0.004682	0.3	)											
	(	0.976046	0.007248	0.3	)											
	(	0.965613	0.010321	0.3	)											
	(	0.953367	0.013863	0.3	)											
	(	0.939351	0.017833	0.3	)											
	(	0.923612	0.022187	0.3	)											
	(	0.906208	0.026874	0.3	)											
	(	0.887198	0.031843	0.3	)											
	(	0.866653	0.03704	0.3	)											
	(	0.844647	0.042411	0.3	)											
	(	0.82126	0.047899	0.3	)											
	(	0.796579	0.053449	0.3	)											
	(	0.770697	0.059005	0.3	)											
	(	0.743712	0.064511	0.3	)											
	(	0.715726	0.069913	0.3	)											
	(	0.686848	0.075158	0.3	)											
	(	0.657189	0.080194	0.3	)											
	(	0.626866	0.084971	0.3	)											
	(	0.595998	0.089439	0.3	)											
	(	0.564709	0.093554	0.3	)											
	(	0.533123	0.097269	0.3	)											
	(	0.50137	0.100545	0.3	)											
	(	0.469578	0.103344	0.3	)											
	(	0.437879	0.105631	0.3	)											
	(	0.406404	0.107376	0.3	)											
	(	0.37482	0.108468	0.3	)											
	(	0.343599	0.108714	0.3	)											
	(	0.313001	0.10811	0.3	)											
	(	0.283167	0.10667	0.3	)											
	(	0.254236	0.104416	0.3	)											
	(	0.226341	0.101384	0.3	)											
	(	0.19961	0.097618	0.3	)											
	(	0.174166	0.093172	0.3	)											
	(	0.150121	0.088108	0.3	)											
	(	0.127583	0.082496	0.3	)											
	(	0.106649	0.07641	0.3	)											
	(	0.087405	0.06993	0.3	)											
	(	0.069929	0.063138	0.3	)											
	(	0.054289	0.056114	0.3	)											
	(	0.04054	0.048938	0.3	)											
	(	0.028731	0.041689	0.3	)											
	(	0.018897	0.034435	0.3	)											
	(	0.011066	0.027241	0.3	)											
	(	0.005256	0.020161	0.3	)											
	(	0.001476	0.013241	0.3	)											
	(	-0.000274	0.006513	0.3	)											
	)															
																
																
	arc	3 12	(	-7.48528137423857	-8.48528137423857	0	)									
	arc	7 13	(	-7.48528137423857	-8.48528137423857	0.3	)									
																
	spline	0	16													
	(															
	(	0.002247	-0.006119	0	)											
	(	0.006409	-0.011672	0	)											
	(	0.012457	-0.016658	0	)											
	(	0.020351	-0.021081	0	)											
	(	0.030046	-0.024945	0	)											
	(	0.041493	-0.02826	0	)											
	(	0.054633	-0.031036	0	)											
	(	0.069404	-0.033287	0	)											
	(	0.085743	-0.035032	0	)											
	(	0.103578	-0.036293	0	)											
	(	0.122838	-0.037096	0	)											
	(	0.143448	-0.037472	0	)											
	(	0.165332	-0.037456	0	)											
	(	0.18841	-0.037089	0	)											
	(	0.212604	-0.036415	0	)											
	(	0.237832	-0.035481	0	)											
	(	0.26401	-0.034339	0	)											
	(	0.291053	-0.033042	0	)											
	(	0.318875	-0.031644	0	)											
	(	0.347385	-0.0302	0	)											
	(	0.37649	-0.028765	0	)											
	(	0.406215	-0.027385	0	)											
	(	0.436788	-0.02594	0	)											
	(	0.467631	-0.02439	0	)											
	(	0.49863	-0.022768	0	)											
	(	0.529667	-0.021106	0	)											
	(	0.560624	-0.019434	0	)											
	(	0.591383	-0.017776	0	)											
	(	0.621824	-0.016155	0	)											
	(	0.651828	-0.014589	0	)											
	(	0.681277	-0.01309	0	)											
	(	0.710053	-0.011669	0	)											
	(	0.738042	-0.010332	0	)											
	(	0.76513	-0.009085	0	)											
	(	0.791206	-0.007927	0	)											
	(	0.816164	-0.006859	0	)											
	(	0.839901	-0.005879	0	)											
	(	0.862316	-0.004983	0	)											
	(	0.883315	-0.00417	0	)											
	(	0.902809	-0.003435	0	)											
	(	0.920716	-0.002777	0	)											
	(	0.936956	-0.002191	0	)											
	(	0.95146	-0.001676	0	)											
	(	0.964163	-0.001232	0	)											
	(	0.97501	-0.000856	0	)											
	(	0.983952	-0.000548	0	)											
	(	0.990949	-0.000308	0	)											
	(	0.99597	-0.000137	0	)											
	(	0.998991	-0.000034	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.002247	-0.006119	0.3	)											
	(	0.006409	-0.011672	0.3	)											
	(	0.012457	-0.016658	0.3	)											
	(	0.020351	-0.021081	0.3	)											
	(	0.030046	-0.024945	0.3	)											
	(	0.041493	-0.02826	0.3	)											
	(	0.054633	-0.031036	0.3	)											
	(	0.069404	-0.033287	0.3	)											
	(	0.085743	-0.035032	0.3	)											
	(	0.103578	-0.036293	0.3	)											
	(	0.122838	-0.037096	0.3	)											
	(	0.143448	-0.037472	0.3	)											
	(	0.165332	-0.037456	0.3	)											
	(	0.18841	-0.037089	0.3	)											
	(	0.212604	-0.036415	0.3	)											
	(	0.237832	-0.035481	0.3	)											
	(	0.26401	-0.034339	0.3	)											
	(	0.291053	-0.033042	0.3	)											
	(	0.318875	-0.031644	0.3	)											
	(	0.347385	-0.0302	0.3	)											
	(	0.37649	-0.028765	0.3	)											
	(	0.406215	-0.027385	0.3	)											
	(	0.436788	-0.02594	0.3	)											
	(	0.467631	-0.02439	0.3	)											
	(	0.49863	-0.022768	0.3	)											
	(	0.529667	-0.021106	0.3	)											
	(	0.560624	-0.019434	0.3	)											
	(	0.591383	-0.017776	0.3	)											
	(	0.621824	-0.016155	0.3	)											
	(	0.651828	-0.014589	0.3	)											
	(	0.681277	-0.01309	0.3	)											
	(	0.710053	-0.011669	0.3	)											
	(	0.738042	-0.010332	0.3	)											
	(	0.76513	-0.009085	0.3	)											
	(	0.791206	-0.007927	0.3	)											
	(	0.816164	-0.006859	0.3	)											
	(	0.839901	-0.005879	0.3	)											
	(	0.862316	-0.004983	0.3	)											
	(	0.883315	-0.00417	0.3	)											
	(	0.902809	-0.003435	0.3	)											
	(	0.920716	-0.002777	0.3	)											
	(	0.936956	-0.002191	0.3	)											
	(	0.95146	-0.001676	0.3	)											
	(	0.964163	-0.001232	0.3	)											
	(	0.97501	-0.000856	0.3	)											
	(	0.983952	-0.000548	0.3	)											
	(	0.990949	-0.000308	0.3	)											
	(	0.99597	-0.000137	0.3	)											
	(	0.998991	-0.000034	0.3	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
flap              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																
