airfoil-pitching-morphing/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver      displacementLaplacian;

displacementLaplacianCoeffs {
    diffusivity quadratic inverseDistance (flap);
}

// solver	    solidBody;
// solver    interpolatingSolidBody;

// solidBodyMotionFunction oscillatingRotatingMotion;


// patches         (flap);
// CofG            (0.5 0 0);

// innerDistance   0.01;
// outerDistance   4.0; 
       
// oscillatingRotatingMotionCoeffs
// {
//    origin          (0.5 0 0);
//    amplitude       (0 0 15);
//    omega           6.28;   
// }

// sixDoFRigidBodyMotionCoeffs
//  {
//      patches         ( Body );
//      innerDistance   25;
//      outerDistance   275;
//      centreOfMass    (0.5 0 0);
//      mass            4.1453e+06;
//      g               (0 0 -9.8065);
//      momentOfInertia (2.7874e+08 5.8901e+08 6.6762e+08);
//      velocity        (0 0 0);
//      rhoName         rhoInf;
//      rhoInf          1024.81;
//      accelerationRelaxation 0.9;
//      accelerationDamping 0.95;
//      report          on;
//      reportToFile    on;
//      solver
//      {
//          type            CrankNicolson;
//      }
//     constraints
//     {
//         pitchingConstraint
//             {
//             sixDoFRigidBodyMotionConstraint   point;
//             centreOfRotation                  (1.0 0 0);
//             }
//     }
    
//     restraints
//     {
//         pitchingRestraint
//             {
//                 sixDoFRigidBodyMotionRestraint        linearAxialAngularSpring;
//                 axis                                  (0.5 0 0);
//                 stiffness                             1.6E1;  //units of Nm/rad
//                 damping                               5678;   //units of Nms/rad
//                 referenceOrientation                  (0 0 20.0);                //Neutral orientation.  Specified as a vector
//             }
//     }
//  }

  
